{"files":{"index.html":{"frameworks":["design","pg.tw.lib","pg.svg.lib","tw"]}},"urls":{"index.html":{"open-with-wrapper":false,"open-page-views":[{"w":1024,"h":0}]}},"breakpoints":["640px","768px","1024px","1280px"],"frameworks":["design","pg.tw.lib","pg.svg.lib","tw"],"template_framework_id":"tailwind","open-pages":["index.html"],"active-design-provider":"tw","design-settings":{"mode":"jit4","external_source_url":null},"ai-project-brief":"## Die Brücke - Sociocultural Center Homepage\n**Project description**: Creation of a high-impact, sophisticated homepage for \"Die Brücke.\" The goal is to establish a strong, professional online presence by translating the \"Modern Studio / Agency\" aesthetic—characterized by massive scale, geometric precision, and strong contrast—into the center's digital identity. The design must adhere strictly to the established custom color variables and Tailwind utility constraints.\n**Design Concept**: **High-Contrast Modernism (Swiss Studio)**. The visual identity is built on structural clarity and purposeful scale. We leverage the stark contrast between the deep, encompassing `bg-primary` (Deep Teal) used for the introductory statement, and the clean, structured `bg-surface-muted` (Light Blue) used for core content. Massive, geometric typography (Swiss Style) is the primary visual element, conveying confidence and authority. The overall mood is confident, precise, and contemporary, treating the center’s services and events as curated, high-value content presented in flexible Bento Grids.\n**Color Palette**: The palette is defined by the mandatory custom utility classes, ensuring brand consistency and high contrast.\n| Custom Class | Color Role | Psychological Usage |\n| :--- | :--- | :--- |\n| `bg-primary` / `text-primary` | Stormy Teal (Deep Teal) | Foundation, stability, and elegance. Used primarily for \"dark mode\" sections (Hero) and light text emphasis. |\n| `bg-surface-muted` | Light Blue | Clean background for content sections, providing a gentle lift from pure white while maintaining readability. |\n| `bg-surface` | White | Standard card/container background. Crisp contrast against `text-primary`. |\n| `text-accent` | Almond Silk (Warm Off-White) | Secondary text emphasis on dark backgrounds; adds warmth and sophistication to headers. |\n| `bg-tangerine` / `text-tangerine` | Bright Orange | High-visibility action and highlights. Reserved for CTAs and critical information emphasis, symbolizing energy and activity. |\n| `bg-secondary` / `text-secondary` | Pearl Aqua (Muted Blue/Green) | Subtler accents and subheadings, offering variation within the Teal base color family. |\n**Typography**:\n*   **Headings**: **Sora**. Used for maximum impact. Geometric, bold, and modern, perfectly suited for the \"Swiss Design\" ethos and massive scale (`text-6xl` to `text-8xl`).\n    *   *Treatment*: Heavy weight (800 or 900), slightly tight tracking (`tracking-tight`) to enhance the architectural feel.\n*   **Body**: **Inter**. A highly legible, contemporary sans-serif optimized for UI screens.\n    *   *Treatment*: Standard readability weight (400 to 500), adequate line height (`leading-relaxed`) to ensure comfort in long-form descriptions or card content.\n**Structure**: The homepage is organized linearly for maximum narrative impact:\n1.  **Hero Section (The Statement)**: Full width, mandatory `bg-primary`. Massive headline (`text-white`), strong subline (`text-secondary` or `text-accent`). Minimalist design, focused purely on the core message and visual identity.\n2.  **Bento Grid (Events & Services)**: Mandatory `bg-surface-muted`. An asymmetrical arrangement showcasing 5-7 core offerings. Each card uses `bg-surface`, heavy padding, rounded corners, and incorporates either large numbers, stylized icons, or bold, encapsulated titles.\n3.  *(Implied)* **About/Mission Statement Section**: Using `bg-surface-muted` for depth, detailing the center's mission using `text-primary`.\n4.  *(Implied)* **Footer**: Minimalist design, linking essential navigation and contact info.\n**Images**:\nImages must be highly curated and align with the sharp aesthetic.\n*   **Style**: Abstract, architectural, or modern documentary photography. High contrast, focusing on lines, texture, and light/shadow play.\n*   **Usage**: Inside Bento Grid cards, images should be highly cropped or overlaid with strong opacity masks using `bg-primary` to harmonize with the dark mode hero. Vector icons must be clean, large, and geometric.\n**Interactions**:\nInteractions must feel quick and precise, reflecting the \"Studio\" aesthetic:\n*   **Hovers**: Subtle lift (`translate-y-1`, `shadow-xl`) and fast background color shifts (e.g., cards on hover shift slightly to `bg-secondary` or borders highlight `border-tangerine`).\n*   **CTAs**: Use sharp, immediate press effects rather than slow, drawn-out animations.\n*   **Typography Effects**: Subtle use of text transforms or mask effects on the main Hero headline to draw attention without being distracting (e.g., slight parallax or clip-path reveal on load).\nConfigure the Tailwind theme with the project's colors and fonts if [pineconegetdesign] command is available.","recent-classes":["text-[color:var(--primary)]","text-[color:var(--tangerine)]","font-heading","text-accent"],"class-styles-components":"1"}